# FabricationIndex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConnectorInfo..::..FabricationIndex Property
FabricationConnectorInfo Class See Also
---
The index of the connector shown within the fabrication software.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int FabricationIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FabricationIndex As Integer
	Get
```

Visual C++
---
```text
public:
property int FabricationIndex {
	int get ();
}
```

# See Also
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace